benchmarks/https_local_quick_after_ssl_wait_20260325_161319/ping_c1024.wrk.out
Running 5s test @ https://127.0.0.1:18080/ping
  16 threads and 1024 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    21.79ms   40.07ms 486.53ms   96.28%
    Req/Sec     4.14k   823.22     5.53k    92.92%
  Latency Distribution
     50%   14.04ms
     75%   17.84ms
     90%   24.06ms
     99%  262.77ms
  305949 requests in 5.10s, 33.55MB read
Requests/sec:  60003.86
Transfer/sec:      6.58MB